{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "__mul_scalar__0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___sub_scalar_____mul_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_4", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_5_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_5", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_5_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_6", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_6_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_7", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_6_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_8", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_7_dw_conv2d_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_9", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_7_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_10", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_8_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_8_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_12", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_9_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_9_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_12", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_10_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_10_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_12", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_11_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_11_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_12", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_12_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu21", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_12_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm22_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu22", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_12", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_13_dw_conv2d_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm23_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu23", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_13", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_13_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm25_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu25", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_14", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_14_dw_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm26_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu26", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_15", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_14_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm27_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu27", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_16", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_final_conv2d_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm28_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu28", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_16", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c3_lateral_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm29_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu29", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_17", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm31_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm31_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm31_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm30_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu30", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_18", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm33_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm33_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm33_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv3_1_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm32_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu31", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_19", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv3_2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride32_context_conv3_2_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm35_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm35_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu34", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0], [100, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_cls_score_stride32_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_cls_score_stride32_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d39", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_bbox_pred_stride32_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_bbox_pred_stride32_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d42", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0], [116, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_landmark_pred_stride32_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_landmark_pred_stride32_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d43", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0], [119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c2_lateral_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c2_lateral_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm24_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm24_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu24", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_upsampling_slice_like_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[126, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c2_aggr_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c2_aggr_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm34_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu32", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_20", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm37_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm37_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm37_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_2", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm36_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu33", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_21", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0], [137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm39_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm39_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm39_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_3", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv3_1_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm38_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu35", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_22", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[140, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv3_2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride16_context_conv3_2_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm41_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm41_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu38", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[136, 0, 0], [145, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_cls_score_stride16_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_cls_score_stride16_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d48", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_3", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_bbox_pred_stride16_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_bbox_pred_stride16_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d50", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_4", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[154, 0, 0], [161, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_landmark_pred_stride16_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_landmark_pred_stride16_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d51", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_5", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[154, 0, 0], [164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c1_red_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c1_red_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[31, 0, 0], [167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_upsampling_slice_like_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[171, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_c1_aggr_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_c1_aggr_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm40_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu36", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_23", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm43_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm43_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm43_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_4", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm42_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu37", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_24", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[176, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm45_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm45_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm45_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_5", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv3_1_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm44_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu39", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu_25", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[185, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv3_2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "rf_head_stride8_context_conv3_2_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm46_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm46_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu40", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[181, 0, 0], [190, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_cls_score_stride8_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_cls_score_stride8_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d53", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_6", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_4", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_5", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_bbox_pred_stride8_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_bbox_pred_stride8_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d54", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_7", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[199, 0, 0], [206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "face_rpn_landmark_pred_stride8_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "face_rpn_landmark_pred_stride8_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d55", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_8", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[199, 0, 0], [209, 0, 0], [210, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    14, 
    15, 
    17, 
    18, 
    20, 
    21, 
    23, 
    24, 
    26, 
    27, 
    29, 
    30, 
    32, 
    33, 
    35, 
    36, 
    38, 
    39, 
    41, 
    42, 
    44, 
    45, 
    47, 
    48, 
    50, 
    51, 
    53, 
    54, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    65, 
    66, 
    68, 
    69, 
    71, 
    72, 
    74, 
    75, 
    77, 
    78, 
    80, 
    81, 
    83, 
    84, 
    85, 
    87, 
    88, 
    89, 
    90, 
    92, 
    93, 
    94, 
    96, 
    97, 
    98, 
    99, 
    101, 
    102, 
    103, 
    105, 
    106, 
    107, 
    110, 
    111, 
    116, 
    117, 
    119, 
    120, 
    122, 
    123, 
    124, 
    125, 
    128, 
    129, 
    130, 
    132, 
    133, 
    134, 
    135, 
    137, 
    138, 
    139, 
    141, 
    142, 
    143, 
    144, 
    146, 
    147, 
    148, 
    150, 
    151, 
    152, 
    155, 
    156, 
    161, 
    162, 
    164, 
    165, 
    167, 
    168, 
    169, 
    170, 
    173, 
    174, 
    175, 
    177, 
    178, 
    179, 
    180, 
    182, 
    183, 
    184, 
    186, 
    187, 
    188, 
    189, 
    191, 
    192, 
    193, 
    195, 
    196, 
    197, 
    200, 
    201, 
    206, 
    207, 
    209, 
    210
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    202, 
    203, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    212
  ], 
  "heads": [[115, 0, 0], [118, 0, 0], [121, 0, 0], [160, 0, 0], [163, 0, 0], [166, 0, 0], [205, 0, 0], [208, 0, 0], [211, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        11, 
        0, 
        12, 
        13, 
        1, 
        14, 
        15, 
        0, 
        16, 
        17, 
        1, 
        18, 
        19, 
        0, 
        20, 
        21, 
        1, 
        22, 
        23, 
        0, 
        24, 
        25, 
        1, 
        26, 
        27, 
        0, 
        28, 
        29, 
        1, 
        30, 
        31, 
        0, 
        32, 
        33, 
        1, 
        34, 
        35, 
        2, 
        36, 
        37, 
        1, 
        38, 
        39, 
        2, 
        40, 
        41, 
        1, 
        42, 
        43, 
        2, 
        44, 
        45, 
        1, 
        46, 
        47, 
        2, 
        48, 
        49, 
        1, 
        50, 
        51, 
        2, 
        52, 
        53, 
        1, 
        54, 
        55, 
        2, 
        56, 
        57, 
        3, 
        58, 
        59, 
        1, 
        60, 
        61, 
        3, 
        62, 
        63, 
        1, 
        64, 
        65, 
        3, 
        66, 
        67, 
        68, 
        4, 
        69, 
        70, 
        71, 
        72, 
        3, 
        73, 
        74, 
        75, 
        5, 
        76, 
        77, 
        78, 
        79, 
        6, 
        80, 
        81, 
        82, 
        7, 
        83, 
        84, 
        85, 
        5, 
        7, 
        86, 
        87, 
        6, 
        5, 
        6, 
        5, 
        88, 
        89, 
        6, 
        90, 
        91, 
        3, 
        92, 
        93, 
        94, 
        95, 
        1, 
        2, 
        96, 
        97, 
        98, 
        1, 
        99, 
        100, 
        101, 
        102, 
        2, 
        103, 
        104, 
        105, 
        7, 
        106, 
        107, 
        108, 
        109, 
        4, 
        110, 
        111, 
        112, 
        8, 
        113, 
        114, 
        115, 
        7, 
        8, 
        116, 
        117, 
        4, 
        7, 
        4, 
        7, 
        118, 
        119, 
        4, 
        120, 
        121, 
        2, 
        122, 
        123, 
        124, 
        125, 
        8, 
        0, 
        126, 
        127, 
        128, 
        8, 
        129, 
        130, 
        131, 
        132, 
        1, 
        133, 
        134, 
        135, 
        9, 
        136, 
        137, 
        138, 
        139, 
        8, 
        140, 
        141, 
        142, 
        10, 
        143, 
        144, 
        145, 
        9, 
        0, 
        146, 
        147, 
        10, 
        9, 
        10, 
        9, 
        148, 
        149, 
        10, 
        150, 
        151, 
        8]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 112, 112], 
        [1, 3, 112, 112], 
        [16, 3, 3, 3], 
        [16, 1, 1], 
        [1, 16, 56, 56], 
        [32, 16, 1, 1], 
        [32, 1, 1], 
        [1, 32, 56, 56], 
        [32, 1, 3, 3], 
        [32, 1, 1], 
        [1, 32, 28, 28], 
        [32, 32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 28, 28], 
        [32, 1, 3, 3], 
        [32, 1, 1], 
        [1, 32, 28, 28], 
        [32, 32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 28, 28], 
        [32, 1, 3, 3], 
        [32, 1, 1], 
        [1, 32, 14, 14], 
        [64, 32, 1, 1], 
        [64, 1, 1], 
        [1, 64, 14, 14], 
        [64, 1, 3, 3], 
        [64, 1, 1], 
        [1, 64, 14, 14], 
        [64, 64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 14, 14], 
        [64, 1, 3, 3], 
        [64, 1, 1], 
        [1, 64, 7, 7], 
        [128, 64, 1, 1], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 7, 7], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [1, 128, 4, 4], 
        [256, 128, 1, 1], 
        [256, 1, 1], 
        [1, 256, 4, 4], 
        [256, 1, 3, 3], 
        [256, 1, 1], 
        [1, 256, 4, 4], 
        [256, 256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 4, 4], 
        [256, 256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 4, 4], 
        [64, 256, 1, 1], 
        [64], 
