{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    14, 
    15, 
    17, 
    18
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21
  ], 
  "heads": [[16, 0, 0], [20, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        3, 
        4, 
        5, 
        6, 
        0, 
        1, 
        7, 
        8, 
        9, 
        0, 
        10, 
        11, 
        12, 
        1, 
        13, 
        14, 
        0, 
        15, 
        16, 
        2, 
        1]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 266, 164], 
        [10, 3, 3, 3], 
        [10], 
        [10], 
        [1, 10, 264, 162], 
        [1, 10, 132, 81], 
        [16, 10, 3, 3], 
        [16], 
        [16], 
        [1, 16, 130, 79], 
        [32, 16, 3, 3], 
        [32], 
        [32], 
        [1, 32, 128, 77], 
        [4, 32, 1, 1], 
        [4], 
        [1, 4, 128, 77], 
        [2, 32, 1, 1], 
        [2], 
        [1, 2, 128, 77], 
        [1, 2, 128, 77]]]
  }
}