{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[27, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    16, 
    17, 
    18, 
    21, 
    22, 
    25, 
    26
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29
  ], 
  "heads": [[23, 0, 0], [28, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        7, 
        8, 
        9, 
        10, 
        0, 
        1, 
        11, 
        12, 
        13, 
        0, 
        1, 
        14, 
        15, 
        16, 
        2, 
        1, 
        17, 
        18, 
        19, 
        2, 
        3, 
        20, 
        21, 
        4, 
        3, 
        22, 
        23, 
        5, 
        6]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 24, 24], 
        [28, 3, 3, 3], 
        [28], 
        [28], 
        [1, 28, 22, 22], 
        [1, 28, 11, 11], 
        [48, 28, 3, 3], 
        [48], 
        [48], 
        [1, 48, 9, 9], 
        [1, 48, 4, 4], 
        [64, 48, 2, 2], 
        [64], 
        [64], 
        [1, 64, 3, 3], 
        [1, 576], 
        [128, 576], 
        [128], 
        [128], 
        [1, 128], 
        [1, 128], 
        [4, 128], 
        [4], 
        [1, 4], 
        [1, 128], 
        [2, 128], 
        [2], 
        [1, 2], 
        [1, 2]]]
  }
}