{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu5_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_3_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_2_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_1_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[36, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    16, 
    17, 
    18, 
    21, 
    22, 
    23, 
    26, 
    27, 
    30, 
    31, 
    34, 
    35
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38
  ], 
  "heads": [[28, 0, 0], [32, 0, 0], [37, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        8, 
        9, 
        10, 
        11, 
        0, 
        1, 
        12, 
        13, 
        14, 
        0, 
        1, 
        15, 
        16, 
        17, 
        2, 
        3, 
        18, 
        19, 
        20, 
        2, 
        1, 
        21, 
        22, 
        23, 
        3, 
        2, 
        24, 
        25, 
        4, 
        2, 
        26, 
        27, 
        5, 
        2, 
        28, 
        29, 
        6, 
        7]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 48, 48], 
        [32, 3, 3, 3], 
        [32], 
        [32], 
        [1, 32, 46, 46], 
        [1, 32, 23, 23], 
        [64, 32, 3, 3], 
        [64], 
        [64], 
        [1, 64, 21, 21], 
        [1, 64, 10, 10], 
        [64, 64, 3, 3], 
        [64], 
        [64], 
        [1, 64, 8, 8], 
        [1, 64, 4, 4], 
        [128, 64, 2, 2], 
        [128], 
        [128], 
        [1, 128, 3, 3], 
        [1, 1152], 
        [256, 1152], 
        [256], 
        [256], 
        [1, 256], 
        [1, 256], 
        [10, 256], 
        [10], 
        [1, 10], 
        [1, 256], 
        [4, 256], 
        [4], 
        [1, 4], 
        [1, 256], 
        [2, 256], 
        [2], 
        [1, 2], 
        [1, 2]]]
  }
}