{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "split0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_split", 
        "num_inputs": "1", 
        "num_outputs": "5"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 1, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 2, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 3, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_5_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu1_5_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 4, 0], [58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_5_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_5_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_5_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_5_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_flatten", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [29, 0, 0], [43, 0, 0], [57, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_1_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_1_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_2_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_2_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_3_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_4_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_4_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_5_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_5_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_5_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    21, 
    22, 
    23, 
    26, 
    27, 
    28, 
    30, 
    31, 
    32, 
    35, 
    36, 
    37, 
    40, 
    41, 
    42, 
    44, 
    45, 
    46, 
    49, 
    50, 
    51, 
    54, 
    55, 
    56, 
    58, 
    59, 
    60, 
    63, 
    64, 
    65, 
    68, 
    69, 
    70, 
    73, 
    74, 
    75, 
    78, 
    79, 
    80, 
    83, 
    84, 
    87, 
    88, 
    89, 
    92, 
    93, 
    96, 
    97, 
    98, 
    101, 
    102, 
    105, 
    106, 
    107, 
    110, 
    111, 
    114, 
    115, 
    116, 
    119, 
    120
  ], 
  "node_row_ptr": [
    0, 
    1, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126
  ], 
  "heads": [[85, 0, 0], [94, 0, 0], [103, 0, 0], [112, 0, 0], [121, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        14, 
        4, 
        3, 
        2, 
        1, 
        0, 
        15, 
        16, 
        17, 
        5, 
        4, 
        18, 
        19, 
        20, 
        5, 
        4, 
        21, 
        22, 
        23, 
        6, 
        24, 
        25, 
        26, 
        5, 
        4, 
        27, 
        28, 
        29, 
        5, 
        3, 
        30, 
        31, 
        32, 
        4, 
        33, 
        34, 
        35, 
        5, 
        2, 
        36, 
        37, 
        38, 
        5, 
        3, 
        39, 
        40, 
        41, 
        2, 
        42, 
        43, 
        44, 
        5, 
        1, 
        45, 
        46, 
        47, 
        5, 
        3, 
        48, 
        49, 
        50, 
        1, 
        51, 
        52, 
        53, 
        5, 
        0, 
        54, 
        55, 
        56, 
        5, 
        3, 
        57, 
        58, 
        59, 
        0, 
        5, 
        60, 
        61, 
        62, 
        6, 
        3, 
        63, 
        64, 
        65, 
        7, 
        8, 
        66, 
        67, 
        9, 
        3, 
        68, 
        69, 
        70, 
        7, 
        8, 
        71, 
        72, 
        10, 
        3, 
        73, 
        74, 
        75, 
        7, 
        8, 
        76, 
        77, 
        11, 
        3, 
        78, 
        79, 
        80, 
        7, 
        8, 
        81, 
        82, 
        12, 
        3, 
        83, 
        84, 
        85, 
        7, 
        8, 
        86, 
        87, 
        13]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 15, 24, 24], 
        [1, 3, 24, 24], 
        [1, 3, 24, 24], 
        [1, 3, 24, 24], 
        [1, 3, 24, 24], 
        [1, 3, 24, 24], 
        [28, 3, 3, 3], 
        [28], 
        [28], 
        [1, 28, 22, 22], 
        [1, 28, 11, 11], 
        [48, 28, 3, 3], 
        [48], 
        [48], 
        [1, 48, 9, 9], 
        [1, 48, 4, 4], 
        [64, 48, 2, 2], 
        [64], 
        [64], 
        [1, 64, 3, 3], 
        [28, 3, 3, 3], 
        [28], 
        [28], 
        [1, 28, 22, 22], 
        [1, 28, 11, 11], 
        [48, 28, 3, 3], 
        [48], 
        [48], 
        [1, 48, 9, 9], 
        [1, 48, 4, 4], 
        [64, 48, 2, 2], 
        [64], 
        [64], 
        [1, 64, 3, 3], 
        [28, 3, 3, 3], 
        [28], 
        [28], 
        [1, 28, 22, 22], 
        [1, 28, 11, 11], 
        [48, 28, 3, 3], 
        [48], 
        [48], 
        [1, 48, 9, 9], 
        [1, 48, 4, 4], 
        [64, 48, 2, 2], 
        [64], 
        [64], 
        [1, 64, 3, 3], 
        [28, 3, 3, 3], 
        [28], 
        [28], 
        [1, 28, 22, 22], 
        [1, 28, 11, 11], 
        [48, 28, 3, 3], 
        [48], 
        [48], 
        [1, 48, 9, 9], 
        [1, 48, 4, 4], 
        [64, 48, 2, 2], 
        [64], 
        [64], 
        [1, 64, 3, 3], 
        [28, 3, 3, 3], 
        [28], 
        [28], 
        [1, 28, 22, 22], 
        [1, 28, 11, 11], 
        [48, 28, 3, 3], 
        [48], 
        [48], 
        [1, 48, 9, 9], 
        [1, 48, 4, 4], 
        [64, 48, 2, 2], 
        [64], 
        [64], 
        [1, 64, 3, 3], 
        [1, 2880], 
        [256, 2880], 
        [256], 
        [256], 
        [1, 256], 
        [1, 256], 
        [64, 256], 
        [64], 
        [64], 
        [1, 64], 
        [1, 64], 
        [2, 64], 
        [2], 
        [1, 2], 
        [1, 256], 
        [64, 256], 
        [64], 
        [64], 
        [1, 64], 
        [1, 64], 
        [2, 64], 
        [2], 
        [1, 2], 
        [1, 256], 
        [64, 256], 
        [64], 
        [64], 
        [1, 64], 
        [1, 64], 
        [2, 64], 
        [2], 
        [1, 2], 
        [1, 256], 
        [64, 256], 
        [64], 
        [64], 
        [1, 64], 
        [1, 64], 
        [2, 64], 
        [2], 
        [1, 2], 
        [1, 256], 
        [64, 256], 
        [64], 
        [64], 
        [1, 64], 
        [1, 64], 
        [2, 64], 
        [2], 
        [1, 2]]]
  }
}